# 데이터베이스

# 데이터를 저장, 사용하기 위한 메모리 상자룰 만들어서 사용해왔다.

# [변수] - [자료구조] - (함수) - (클래스) - (객체구조) - [텍스트 파일] - [CSV] - [데이터베이스]

# 계층형 데이터베이스(Hierarchical DBMS)
# 객체형 데이터베이스 Object-Oriented DBMS
# 네트워크 데이터베이스 Network DBMS
# 관계형 데이터베이스(Realtional DBMS)

# RDBMS
# ㄴ테이블 형태로 구성된 데이터베이스
# 사원번호    사원 이름     사원 직급     부서 이름    위치
# 0001         Adam          대리          개발      서울
# 0002         Beny          부장          본부      분당
# 0003         Chen          사원          개발      서울

# 데이터의 독립 특성을 규정해서 데이터 묶음으로 나눈다.
# 사원번호    사원 이름     사원 직급     부서 코드 
# 0001         Adam          대리          10   
# 0002         Beny          부장          20    
# 0003         Chen          사원          10    

# 부서 코드    부서 이름    위치
#    10          개발      서울
#    20          본부      분당

# 동시성, 보안, 성능

# 장점 : 효율적인 관리, 정확성, 백업 및 복구, 중복된 데이터 처리
# 단점 : 데이터를 넣을 때 중복된 데이터 확인

# SQL (Structured Query Language) -> RDBMS 사용 언어

# 명령어
# DQL (Data Query Language) : RDBMS 저장한 데이터를 원하는 방식으로 조회하는 명령어
# DML(Data Manipulation Language) : RDBMS 테이블 데이터를 저장, 수정, 삭제하는 명령어
# DDL(Data DEfinition Language) : RDBMS 관리를 위해서 테이블을 포함한 객체들을 생성, 수정, 삭제하는 명령어

# 관계형 데이터베이스 : 행과 열의 특성을 맞추어 저장된 테이블
# 테이블 : 관계(relation)
# 행 : row, 튜플(tuple), 레코드(record)
# 열 : cloumn, 애트리뷰트(attribute), 필드(field)

# 키 Key -> 수많은 데이터들을 구별해줄 값

# 1.기본키
# - 테이블에 저장된 유일한 값
# - 중복된 값이 없어야 함
# - NULL 값을 가질 수가 없다.

# 2.보조키 (대체키 alterante key, 후보키 candidate key)
# - 기본키의 조건을 만족하면 기본키가 될 수 있다.

# 3.외래키
# - 특정 테이블에 포함되어 있고, 다른 테이블의 기본키로 지정된 키

# 4.복합키
# - 여러 열을 조합하여 기본키 역할을 할 수 있게 만든 키
# 사원번호 데이터 손실 -> 사원 이름 + 부서 코드로 보갑키 : Adam10 Beny20 CHen10

# 사원번호    사원 이름     사원 직급     부서 코드 
# 0001         Adam          대리          10   
# 0002         Beny          부장          20    
# 0003         Chen          사원          10    

# 부서 코드    부서 이름    위치
#    10          개발      서울
#    20          본부      분당